export const courses = [
  {
    title: 'Начальный (Junior Frontend Developer)',
    price: '80 000',
    description: 'Этот курс предназначен для тех, кто делает первые шаги в мире фронтенд-разработки.',
    features: [
      'Основы браузера и настройка окружения',
      'HTML, CSS и SCSS',
      'React 18 и основы компонентного подхода',
      'Redux Toolkit (RTK)',
      'TypeScript основы',
      'Material-UI (MUI)',
      'Git и основы командной работы',
      'SCRUM и Agile-методологии',
      'Составление резюме и подготовка к собеседованиям'
    ],
    result: 'После прохождения курса вы сможете уверенно работать с базовыми инструментами и технологиями, создать свое портфолио и быть готовым к собеседованиям на Junior позицию.'
  },
  {
    title: 'Продвинутый (Middle Frontend Developer)',
    price: '120 000',
    description: 'Для тех, кто хочет углубить знания и перейти на уровень Middle разработчика.',
    features: [
      'Углубленное изучение Redux Toolkit и MobX',
      'Webpack и Vite',
      'ESLint и Prettier',
      'Feature-Sliced Design (FSD)',
      'React 18-19 углубленно',
      'TypeScript продвинутый уровень',
      'Паттерны проектирования',
      'Оптимизация и рефакторинг',
      'Доступ к эксклюзивным материалам'
    ],
    result: 'После прохождения курса вы сможете разрабатывать сложные веб-приложения, внедрять современные технологии и уверенно пройти собеседования на Middle позицию.',
    isPopular: true
  }
];