export const courses = [
  {
    title: 'Начальный (Junior Frontend Developer)',
    price: '60 000',
    description: 'Этот курс предназначен для тех, кто делает первые шаги в мире фронтенд-разработки.',
    features: [
      'Основы браузера и настройка окружения',
      'HTML',
      'CSS и SCSS',
      'JavaScript',
      'React 18',
      'Основы компонентного подхода',
      'Redux Toolkit Query',
      'TypeScript основы',
      'Material-UI (MUI)',
      'Работа в команде',
      'Работа над пет-проектом',
      'Git',
      'SCRUM и Agile-методологии',
    ],
    result: 'После прохождения курса вы сможете уверенно работать с базовыми инструментами и технологиями, создать свое портфолио и быть готовым к собеседованиям на Junior позицию.'
  },
  {
    title: 'Продвинутый (Middle Frontend Developer)',
    price: '120 000',
    description: 'Для тех, кто хочет углубить знания и перейти на уровень Middle разработчика.',
    features: [
      '+ Начальный курс',
      'Углубленное изучение React 18',
      'Создание индивидуальных проектов',
      'Составление резюме и подготовка к собеседованиям',
      'Решение задач из собеседований',
      'Изучение архитектур web разработки',
      'Паттерны проектирования web приложений',
      'Оптимизация и рефакторинг',
      'Настройка сборщиков проекта: Webpack и Vite',
      'TypeScript продвинутый уровень',
      'Настрйока ESLint и Prettier',
      'Доступ к эксклюзивным материалам'
    ],
    result: 'После прохождения курса вы сможете разрабатывать сложные веб-приложения, внедрять современные технологии и уверенно пройти собеседования на Junior или Middle позицию.',
    isPopular: true
  }
];